Regi = {
    :hokkaido => '北海道',
    :tohoku => '東北',
    :kanto => '関東',
    :chubu => '中部',
    :kansai => '関西', 
    :chugoku => '中国ー四国',
    :kyusyu => '九州ー沖縄'
} 
REGION = ['北海道','東北', '東北', '東北', '東北', '東北', '東北',
    '関東', '関東', '関東', '関東', '関東', '関東', '関東',
    '中部', '中部', '中部', '中部', '中部', '中部', '中部', '中部', '中部',
    '関西', '関西', '関西', '関西', '関西', '関西', '関西', 
    '中国ー四国', '中国ー四国', '中国ー四国', '中国ー四国', '中国ー四国', '中国ー四国', '中国ー四国', '中国ー四国', '中国ー四国',
    '九州ー沖縄', '九州ー沖縄', '九州ー沖縄', '九州ー沖縄', '九州ー沖縄', '九州ー沖縄', '九州ー沖縄', '九州ー沖縄'
]
PREFECTURE_NAMES = {
    :hokkaido => ['北海道'],
    :tohoku => ['青森県', '岩手県', '宮城県', '秋田県', '山形県', '福島県'],
    :kanto => ['茨城県', '栃木県', '群馬県', '埼玉県', '千葉県', '東京都', '神奈川県'],
    :chubu => ['新潟県', '富山県', '石川県', '福井県', '山梨県', '長野県', '岐阜県', '静岡県', '愛知県'],
    :kansai => ['三重県', '滋賀県', '京都府', '大阪府', '兵庫県', '奈良県', '和歌山県'], 
    :chugoku => ['鳥取県', '島根県', '岡山県', '広島県', '山口県', '徳島県', '香川県', '愛媛県', '高知県'],
    :kyusyu => ['福岡県', '佐賀県', '長崎県', '熊本県', '大分県', '宮崎県', '鹿児島県', '沖縄県']
}
Pref = {
    'hokkaidou' => '北海道',
    'aomori' => '青森県',
    'iwate' => '岩手県',
    'miyagi' => '宮城県',
    'akita' => '秋田県',
    'yamagata' => '山形県',
    'fukushima' => '福島県',
    'ibaraki' => '茨城県',
    'tochigi' => '栃木県',
    'gunma' => '群馬県',
    'saitama' => '埼玉県',
    'chiba' => '千葉県',
    'tokyo' => '東京都',
    'kanagawa' => '神奈川県',
    'nigata' => '新潟県',
    'toyama' => '富山県',
    'isikawa' => '石川県',
    'fukui' => '福井県',
    'yamanashi' => '山梨県',
    'nagano' => '長野県',
    'gifu' => '岐阜県',
    'sizuoka' => '静岡県',
    'aichi' => '愛知県',
    'mie' => '三重県',
    'siga' => '滋賀県',
    'kyoto' => '京都府',
    'osaka' => '大阪府',
    'hyogo' => '兵庫県',
    'nara' => '奈良県',
    'wakayama' => '和歌山県',
    'tottori' => '鳥取県',
    'shimane' => '島根県',
    'okayama' => '岡山県',
    'hiroshima' => '広島県',
    'yamaguti' => '山口県',
    'tokushima' => '徳島県',
    'kagawa' => '香川県',
    'ehime' => '愛媛県',
    'koti' => '高知県',
    'fukuoka' => '福岡県',
    'saga' => '佐賀県',
    'nagasaki' => '長崎県',
    'kumamoto' => '熊本県',
    'oita' => '大分県',
    'miyazaki' => '宮崎県',
    'kagosima' => '鹿児島県',
    'okinawa' => '沖縄県'
}


47.times do |n|
c = Prefecture.create!(
  region: REGION[n],
  name: Pref.values[n],
  romaji: Pref.keys[n]
  )


end